# config.py

from dataclasses import dataclass

@dataclass
class Config:
    chars: str = 'абвгдеёжзийклмнопрстуфхцчшщъыьэюя'
    max_word_len: int = 20
    max_seq_len: int = 128

    max_words: int = 100_000

    char_emb_dim: int = 32
    cnn_filters: int = 256
    lstm_hidden: int = 128
    lstm_layers: int = 1
    dropout: float = 0.5

    lr: float = 1e-3
    epochs: int = 30
    batch_size: int = 512
    grad_norm: float = 5.0

    wiki_limit: int = 1_000_000

    ALLOWED_CHARS = "абвгдеёжзийклмнопрстуфхцчшщъыьэюяАБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ0123456789 ."
    neigbours = {
            "й": "цф",
            "ц": "йуыф",
            "у": "цквы",
            "к": "уегф",
            "е": "кнрп",
            "н": "егпр",
            "г": "ншор",
            "ш": "гщдл",
            "щ": "шздк",
            "з": "щхжд",
            "х": "зэж",
            "ф": "йцыч",
            "ы": "фцвчс",
            "в": "цыуас",
            "а": "вукепм",
            "п": "аекнрм",
            "р": "пенготи",
            "о": "ргншлдт",
            "л": "ошщздьб",
            "д": "лщзхжю",
            "ж": "дзхэ.",
            "э": "ж.",
            "я": "фыч",
            "ч": "яфывс",
            "с": "чвыам",
            "м": "сапить",
            "и": "мпирт",
            "т": "ипрноь",
            "ь": "тролдб",
            "б": "ьюлд",
            "ю": "бдз",
        }
    
    phonetic_rules = {
        "о": ["а"], "а": ["о"],
        "е": ["и", "я"], "и": ["е"],
        
        "тся": ["ться"], "ться": ["тся"],
        
        "стн": ["сн"],
        "здн": ["зн"],
        "вств": ["ств"],
        "лнц": ["нц", "нц"],
        
        "сд": ["зд"],
        "бес": ["без"],
        "раз": ["рас"],
        "чт": ["шт"],
        "его": ["ево"],
        "ого": ["ово"],
        
        "жи": ["жы"], "ши": ["шы"],
        "чк": ["чьк"], "чн": ["чьн"],
    }


config = Config()